Repository: 84000/data-translation-memory
Catalog: Toh_244-Proper_Dharma_Conduct-v2.tmx
Source language: bo
Languages: en

source: ཞིང་ཚད་མེད་པ་ལ་ཡང་མོས་པར་གྱིས་ཤིག །
en: Have interest in a limitless field.

source: འཐོབ་པ་ཆེན་པོ་ནི་མ་སྒྲུབས་ཤིག །
en: Do not attain a great acquisition.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཇི་ཙམ་དུ་ཆུང་བའི་ས་བོན་ལ་ཡང་བརྙས་པར་མི་བགྱིད་པ་ལགས།
en: The bodhisattvas asked, “Blessed One, how do bodhisattvas not belittle a seed, however small?

source: ཇི་ལྟར་ན་ཞིང་ཚད་མ་མཆིས་པ་ལ་མོས་པ་ལགས།
en: How do they have interest in a limitless field?

source: ཇི་ལྟར་ན་འཐོབ་པ་ཆེན་པོ་མི་སྒྲུབ་པ་ལགས།
en: How do they not attain a great acquisition?”

source: བཀའ་སྩལ་པ། ཇི་ཙམ་དུ་ཆུང་བའི་ས་བོན་ཞེས་བྱ་བ་ནི་ཇི་ཙམ་དུ་ཆུང་བའི་དགེ་བའི་རྩ་བ་སྟེ། དེ་ལ་བརྙས་པར་མི་བྱའོ། །
en: The Blessed One said, “ ‘A seed however small’ means that however small the root of virtue, they must not despise that.

source: ཞིང་ཚད་མེད་པ་ལ་ཡང་མོས་པར་བྱ་བ་ནི་སངས་རྒྱས་ལ་ཕུལ་བའི་སྦྱིན་པ་ཚད་མེད་པ་ལ་མོས་པར་བྱ་བའོ། །
en: ‘Having interest in a limitless field’ means having interest in the immeasurable generosity of offering to the Buddha.

source: འཐོབ་པ་ཆེན་པོ་མི་སྒྲུབ་པ་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་སྦྱིན་པའི་ཕྱིར་ཏེ་དེ་ནི་ཚུལ་ལོ། །
en: ‘Not attaining a great acquisition’ means giving to all beings. That is the proper conduct.

source: རིགས་ཀྱི་བུ་དག་དེ་ལྟ་བས་ན་ཆགས་པ་རྣམས་ནི་ཁོང་དུ་ཆུད་པར་གྱིས་ཤིག །
en: “Therefore, noble sons, understand attachment,

source: ཆགས་པ་རྣམས་ལ་ནི་སྤྱོད་ཅིག །
en: engage with attachment,

source: ཆགས་པ་ལ་ཞེན་པ་རྣམས་ལ་ནི་ལྟོས་ཤིག །
en: consider those who crave attachment, and

source: ཆགས་པ་མེད་པར་ནི་མ་ལྟུང་ཤིག །
en: do not fall into being without attachment.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཆགས་པ་རྣམས་འཚལ་བ་ལགས།
en: The bodhisattvas asked, “Blessed One, how do bodhisattvas understand attachment?

source: ཇི་ལྟར་ན་ཆགས་པ་ལ་ཞེན་པ་རྣམས་ལ་ལྟ་བ་ལགས།
en: How do they consider those who crave attachment?

source: ཇི་ལྟར་ན་ཆགས་པ་མ་མཆིས་པ་ཉིད་དུ་མི་ལྟུང་བ་ལགས།
en: How do they not fall into being without attachment?”

source: བཀའ་སྩལ་པ། ཆགས་པ་ཞེས་བྱ་བ་ནི་ཐེག་པ་དམན་པ་ལ་འདོད་པ་དང་། ཁོང་ཁྲོ་བའི་སེམས་ཏེ། དེ་གཉིས་ནི་བྱང་ཆུབ་སེམས་དཔས་བསྲུང་བར་བྱའོ། །
en: The Blessed One said, “ ‘Attachment’ means desiring the Lesser Vehicle, and it means the angry mind. Bodhisattvas must be on guard against these two.

source: ཆགས་པ་རྣམས་ལ་སྤྱད་པ་ནི་འདོད་པ་དང་། གཟུགས་དང་། གཟུགས་མེད་པ་རྣམས་སུའོ། །
en: ‘Engaging with attachment’ means engaging with attachment in the desire, form, and formless realms.

source: ཆགས་པ་ལ་ཞེན་པ་རྣམས་ལ་ལྟ་བ་ནི་ཆགས་པ་མེད་པ་ཉིད་དུ་མི་ལྟུང་བ་ནི་མངོན་པར་འདུ་བྱ་བ་མེད་པ་སྟེ་དེ་ནི་ཚུལ་ལོ། །
en: ‘Considering those who crave attachment’ means not falling into the unconditioned state that is without attachment. That is the proper conduct.

source: རིགས་ཀྱི་བུ་དག་དེ་ལྟ་བས་ན་ཡང་བར་ཡང་གྱིས་ཤིག །ཁུར་ཆེན་པོ་ཡང་ཁྱེར་ཅིག །
en: “Therefore, noble sons, on the one hand unburden yourselves, and on the other hand carry a great burden.

source: མ་བླངས་པ་ནི་མ་ལེན་ཅིག །
en: Do not take up what has not been taken up.

source: བླངས་པ་ནི་ཉམས་འོག་ཏུ་ཆུད་པར་གྱིས་ཤིག །
en: Bring what you have taken up into experience.”

source: ཇི་ལྟར་ན་ཁུར་ཆེན་པོ་ཁྱེར་བ་ལགས།
en: How do they carry a great burden?

source: ཇི་ལྟར་ན་མ་བླངས་པ་མི་ལེན་པ་ལགས།
en: How do they avoid lifting what has not been taken up?

source: ཇི་ལྟར་ན་བླངས་པ་ཉམས་འོག་ཏུ་ཆུད་པར་བགྱིད་པ་ལགས།
en: How do they bring what they have taken up into experience?”

source: བཀའ་སྩལ་པ། ཡང་བར་བྱ་བ་ནི་ཉོན་མོངས་པ་ཐམས་ཅད་བཅད་དོ། །
en: The Blessed One said, “ ‘Unburdening’ means eliminating all afflictions.

source: ཁུར་ཆེན་པོ་བཀུར་བ་ནི་སེམས་ཅན་ཐམས་ཅད་དོ། །
en: ‘Carrying a great burden’ means carrying all sentient beings.

source: མ་བླངས་པ་མི་བླང་བ་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པའོ། །
en: ‘Not taking up what has not been taken up’ means not taking up the vehicles of the hearers and solitary buddhas.

source: བླངས་པ་ཉམས་འོག་ཏུ་ཆུད་པར་བྱ་བ་ནི་ཐེག་པ་ཆེན་པོ་སྟེ་དེ་ནི་ཚུལ་ལོ། །
en: ‘Bringing what they have taken up into experience’ refers to the Great Vehicle. That is the proper conduct.

source: རིགས་ཀྱི་བུ་དག་དེ་ལྟ་བས་ན་སྨད་པར་ཡང་གྱིས་ཤིག །བསྟོད་པར་ཡང་གྱིས་ཤིག །
en: “Therefore, noble sons, on the one hand condemn, and on the other hand praise.

source: ཉེ་བར་བསྙེན་པར་ཡང་གྱིས་ཤིག །སྤང་བར་ཡང་གྱིས་ཤིག །
en: On the one hand approach, and on the other hand abandon.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སྨོད་པ་ལགས།
en: The bodhisattvas asked, “Blessed One, how do bodhisattvas condemn?

source: ཇི་ལྟར་ན་བསྟོད་པ་ལགས།
en: How do they praise?

source: ཇི་ལྟར་ན་ཉེ་བར་བསྙེན་པ་ལགས།
en: How do they approach?

source: ཇི་ལྟར་ན་སྤང་བ་ལགས།
en: And how do they abandon?”

source: བཀའ་སྩལ་པ། སྨད་པ་ནི་མི་དགེ་བའི་ཆོས་ཐམས་ཅད་སྨད་པའོ། །
en: The Blessed One said, “ ‘Condemning’ means condemning all nonvirtuous phenomena.

source: བསྟོད་པ་ནི་དགེ་བའི་ཆོས་ཐམས་ཅད་བསྟོད་པའོ། །
en: ‘Praising’ means praising all virtuous phenomena.

source: བསྙེན་པ་ནི་འཕགས་པའི་ལམ་མོ། །
en: ‘Approaching’ means approaching the path of the noble ones.

source: སྤང་བ་ནི་མི་དགེ་བའི་ཕྱོགས་ཀྱི་ལམ་ཐམས་ཅད་དེ་དེ་ནི་ཚུལ་ལོ། །
en: ‘Abandoning’ means abandoning all paths that lead in nonvirtuous directions. That is the proper conduct.

source: རིགས་ཀྱི་བུ་དག་དེ་ལྟ་བས་ན་གྲོང་དང་། གྲོང་ཁྱེར་དང་། ཡུལ་འཁོར་དང་། ཕོ་བྲང་འཁོར་དག་ཏུ་ནི་བསམ་གཏན་གྱི་སྟོབས་སྟོན་ཅིང་།
en: “Therefore, noble sons, demonstrate the power of concentration in villages, cities, kingdoms, and royal courts, and

source: དགོན་པ་དང་བས་མཐའ་རྣམས་སུ་ནི་ཉོན་མོངས་པ་ཆུང་བར་སྟོན་ཅིག །
en: demonstrate few afflictions in the jungles and borderlands.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་གྲོང་དང་། གྲོང་ཁྱེར་དང་། ཡུལ་འཁོར་དང་། ཕོ་བྲང་འཁོར་རྣམས་སུ་བསམ་གཏན་གྱི་སྟོབས་སྟོན་པ་ལགས།
en: The bodhisattvas asked, “Blessed One, how do bodhisattvas demonstrate the power of concentration in villages, cities, kingdoms, and royal courts?

source: ཇི་ལྟར་ན་དགོན་པ་དང་། བས་མཐའ་རྣམས་སུ་ཉོན་མོངས་པ་ཆུང་བར་སྟོན་པ་ལགས།
en: How do they demonstrate few afflictions in jungles and borderlands?”

source: !བཀའ་སྩལ་པ། གྲོང་དང་། གྲོང་ཁྱེར་དང་། ཡུལ་འཁོར་དང་། ཕོ་བྲང་འཁོར་དག་ཏུ་ཕྱིན་པ་ན་གཟུགས་དང་། སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་བྱ་རེག་པ་དག་སྣང་བར་འགྱུར་ཏེདེ་དག་ནི་བསམ་གཏན་གྱི་སྟོབས་ཀྱིས་མནན་པར་བྱའོ། །
en: The Blessed One said, “When they reach villages, cities, kingdoms, and royal courts, many gross types of forms, sounds, smells, tastes, and tactile sensations will manifest, but these must be subdued through the power of concentration.

source: དགོན་པ་དང་བས་མཐའ་རྣམས་ན་འདུག་པའི་ཚེ་ཉོན་མོངས་པ་གང་དག་སྐྱེ་བར་འགྱུར་བ་དེ་དག་ནི་དབེན་པའི་ཡོན་ཏན་གྱིས་མནན་པར་བྱ་སྟེ་དེ་ནི་ཚུལ་ལོ། །
en: When dwelling in jungles and borderlands, they must subdue those afflictions that arise with the qualities of disengagement. That is the proper conduct.

source: རིགས་ཀྱི་བུ་དག་དེ་ལྟ་བས་ན་ཆུའི་ནང་ནའང་འདུག་པར་གྱིས་ཤིག །རྟག་པར་སྐོམ་པར་ཡང་གྱིས་ཤིག །
en: “Therefore, noble sons, on the one hand remain in water, and on the other hand always be thirsty.

source: སྐོམ་པ་ཡང་སོལ་ཅིག །སྐོམ་པ་མེད་པར་མ་བྱེད་ཅིག །
en: On the one hand quench your thirst, but do not be free from thirst.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཆབ་ཀྱི་ནང་ན་མཆིས་པ་ལགས།
en: The bodhisattvas asked, “Blessed One, how do bodhisattvas remain in water?

source: ཇི་ལྟར་ན་རྟག་ཏུ་སྐོམ་པ་ལགས།
en: How are they always thirsty?

source: ཇི་ལྟར་ན་སྐོམ་པ་བསལ་བ་ལགས།
en: How do they quench their thirst?

source: ཇི་ལྟར་ན་སྐོམ་པ་མ་མཆིས་པར་མི་བགྱིད་པ་ལགས།
en: How are they not free from thirst?”

source: བཀའ་སྩལ་པ། ཆུའི་ནང་ན་འདུག་པར་བྱ་བ་ནི། ཆོས་ཀྱི་ཚུལ་གནས་པར་བྱ་བའོ། །
en: The Blessed One said, “ ‘Remaining in water’ means observing proper Dharma conduct.

source: རྟག་པར་སྐོམ་པར་བྱ་བ་ནི་ཆོས་ཀྱིས་སྐོམ་པར་བྱས་པའོ། །
en: ‘Always being thirsty’ means thirsting for the Dharma.

source: སྐོམ་པ་བསལ་བ་ནི་ཆོས་ཀྱིས་ཆོས་ཀྱི་བྱ་བ་བསྒྲུབ་པའོ། །
en: ‘Quenching their thirst’ means accomplishing Dharma activity by means of the Dharma.

source: སྐོམ་པ་མེད་པར་མི་བྱ་བ་ནི་འདུས་མ་བྱས་སུ་ལྟུང་བར་མི་བྱ་བ་སྟེ་དེ་ནི་ཚུལ་ལོ། །
en: ‘Being free from thirst’ means not straying into the uncompounded state. That is the proper conduct.

source: རིགས་ཀྱི་བུ་དག་དེ་ལྟ་བས་ན་གཅིག་པུ་གྲོགས་མེད་པར་ཡང་གྱིས་ཤིག །གཡོག་མང་པོ་དང་འཁོར་མང་པོ་དང་ལྡན་པར་ཡང་གྱིས་ཤིག །
en: “Therefore, noble sons, on the one hand be alone and without friends, and on the other hand have many servants and attendants.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་གཅིག་པུ་གྲོགས་མ་མཆིས་པར་ཡང་བགྱིད་པ་ལགས།
en: The bodhisattvas asked, “Blessed One, how are bodhisattvas alone and without friends?

source: ཇི་ལྟར་ན་གཡོག་མང་པོ་དང་འཁོར་མང་པོ་དང་ལྡན་པ་ལགས།
en: How do they have many servants and attendants?”

source: བཀའ་སྩལ་པ། གཅིག་པུ་གྲོགས་མེད་པར་བྱ་བ་ནི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཡང་དག་པར་བསྒྲུབ་པ་ལའོ། །
en: The Blessed One said, “ ‘Being alone and without friends’ means accomplishing all roots of virtue.

source: གཡོག་མང་པོ་དང་ལྡན་པར་བྱ་བ་ནི་དགེ་བའི་རྩ་བ་དེ་དག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉེ་བར་འཚོ་བར་བྱ་བའོ། །
en: ‘Having many servants’ means that those roots of virtue are the sustenance of all beings.

source: འཁོར་མང་པོ་དང་ལྡན་པར་བྱ་བ་ལ་འཁོར་མང་པོ་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཏེ་དེ་ནི་ཚུལ་ལོ། །
en: As for ‘having many attendants,’ this refers to the factors that are in harmony with awakening. That is the proper conduct.

source: རིགས་ཀྱི་བུ་དག་དེ་ལྟ་བས་ན་གྲོལ་བར་ཡང་གྱིས་ཤིག །བཙོན་རར་ཚུད་པར་ཡང་གྱིས་ཤིག །
en: “Therefore, noble sons, on the one hand be free, and on the other hand enter prison.

source: ཕ་རོལ་ཏུ་ཕྱིན་པར་ཡང་གྱིས་ཤིག །ཆུ་བོ་ཆེན་པོའི་ནང་དུ་འདུག་པར་ཡང་གྱིས་ཤིག །
en: On the one hand cross to the other shore, and on the other hand remain in the great rivers.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་གྲོལ་བ་ལགས།
en: The bodhisattvas asked, “Blessed One, how are bodhisattvas free?

source: ཇི་ལྟར་ན་བཙོན་རར་ཚུད་པ་ལགས།
en: How do they enter prison?

source: ཇི་ལྟར་ན་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལགས།
en: How do they cross to the other shore?

source: ཇི་ལྟར་ན་ཆུ་བོ་ཆེན་པོའི་ནང་ན་གནས་པ་ལགས།
en: How do they remain in the great rivers?”

source: བཀའ་སྩལ་པ། གྲོལ་བར་བྱ་བ་ནི་ཉོན་མོངས་པ་དང་བདུད་ཀྱི་བཅིང་བ་ཐམས་ཅད་ལས་སོ། །
en: The Blessed One said, “ ‘Being free’ means being free from all afflictions and bonds of the māras.

source: བཙོན་རར་ཚུད་པར་ཡང་བྱ་བ་ནི་བསམས་བཞིན་དུ་སྐྱེ་བ་རྣམས་སུའོ། །
en: ‘Entering prison’ means taking birth at will.

source: ཕ་རོལ་ཏུ་ཕྱིན་པར་ཡང་བྱ་བ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྐད་ཤེས་པ་ལའོ། །
en: ‘Crossing to the other shore’ means knowing the languages of all beings.

source: ཆུ་བོ་ཆེན་པོའི་ནང་ན་གནས་པར་ཡང་བྱ་བ་ནི་ཆུ་བོ་བཞིས་ཁྱེར་བའི་སེམས་ཅན་སྒྲོལ་བའི་ཕྱིར་ཏེ་དེ་ནི་ཚུལ་ལོ། །
en: They ‘remain in the great rivers’ in order to free those beings who are carried away by the four great rivers. That is the proper conduct.

source: རིགས་ཀྱི་བུ་དག་དེ་ལྟ་བས་ན་ཚད་ཡོད་པ་ལ་ཡང་སོ་སོར་རྟོག་པར་གྱིས་ཤིག །ཚད་མེད་པར་ཡང་མཉམ་པ་ཉིད་དུ་ཁོང་དུ་ཆུད་པར་གྱིས་ཤིག །
en: “Therefore, noble sons, on the one hand contemplate what is measurable, and on the other hand understand the immeasurable to be sameness.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཚད་མཆིས་པ་ལ་ཡང་སོ་སོར་རྟོག་པ་ལགས།
en: The bodhisattvas asked, “Blessed One, how do bodhisattvas contemplate what is measurable?

source: ཇི་ལྟར་ན་ཚད་མ་མཆིས་པ་ལ་ཡང་མཉམ་པ་ཉིད་དུ་ཁོང་དུ་ཆུད་པར་བགྱིད་པ་ལགས།
en: How do they understand the immeasurable to be sameness?”

source: རིགས་ཀྱི་བུ་དག་ཚད་ཡོད་པ་ཞེས་བྱ་བ་ནི་འདུས་བྱས་སོ། །
en: “Noble sons, ‘what is measurable’ is the compounded.

source: ཚད་མེད་པ་ཞེས་བྱ་བ་ནི་འདུས་མ་བྱས་ཏེ།
en: ‘What is immeasurable’ is the uncompounded.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔས་འདུས་བྱས་ཀྱང་སྤང་བར་མི་བྱ་སྟེ།
en: In this regard, on the one hand bodhisattvas should not abandon the compounded, but

source: འདུས་བྱས་སུ་གཏོགས་པའི་ཉོན་མོངས་པ་རྣམས་དང་ཡང་འགྲོགས་པར་མི་བྱའོ། །
en: they should also not associate with afflictions, which are part of the compounded.

source: འདུས་མ་བྱས་ལ་ཡང་བརྟག་པར་བྱ་སྟེ།
en: They should also examine the uncompounded, but

source: སྐྱོན་མེད་པར་ཡང་འཇུག་པར་མི་བྱའོ། །
en: they should not enter the state that is free from faults.

source: འདུས་བྱས་དང་འདུས་མ་བྱས་གཅིག་པའི་མཚན་ཉིད་དང་ལྡན་པའི་ཤེས་རབ་ཀྱིས་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་མཉམ་པ་ཉིད་དུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་བྱ་སྟེ་དེ་ནི་ཚུལ་ལོ། །
en: Through the insight that the compounded and the uncompounded share a single characteristic, they must perfectly awaken within that sameness at the seat of awakening. That is the proper conduct.”

source: ཚུལ་གྱི་ཚིག་འདི་དག་བསྟན་པའི་ཚེ་ལྷའི་བུ་བརྒྱད་སྟོང་ནི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་ཏོ། །
en: When these statements on proper conduct were taught, eight thousand gods gave rise to the mind of awakening.

source: བྱང་ཆུབ་སེམས་དཔའ་ལྔ་བརྒྱ་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: Five hundred bodhisattvas attained acceptance that phenomena are unborn.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: When the Blessed One had said this,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རབ་ཏུ་མང་པོ་དེ་དག་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།
en: the large number of bodhisattva great beings, as well as the world with its gods, humans, asuras, and gandharvas, rejoiced and praised what the Blessed One had said.

source: འཕགས་པ་ཆོས་ཀྱི་ཚུལ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།
en: This concludes the noble Great Vehicle sūtra “Proper Dharma Conduct.”

source: རྒྱ་གར་གྱི་མཁན་པོ་པྲཛྙཱ་བར་མ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེ་ལ་སོགས་པས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།། །།
en: This was translated, edited, and finalized by the Indian scholar Prajñāvarman and the chief editor-translator Venerable Yeshé Dé and others.
